{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_5__activation___output",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "name" : "conv2d_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_5__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_5",
      "top" : "max_pooling2d_5_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_6__activation___output",
      "blob_weights" : 7,
      "K" : 32,
      "blob_biases" : 5,
      "name" : "conv2d_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "max_pooling2d_5_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_6__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_6",
      "top" : "max_pooling2d_6_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_7__activation___output",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "conv2d_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "max_pooling2d_6_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_7__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_7",
      "top" : "max_pooling2d_7_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_8__activation___output",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "name" : "conv2d_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "max_pooling2d_7_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_8__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_8",
      "top" : "max_pooling2d_8_output"
    },
    {
      "mode" : 1,
      "weights" : {

      },
      "top" : "flatten_2_output",
      "type" : "flatten",
      "name" : "flatten_2",
      "bottom" : "max_pooling2d_8_output"
    },
    {
      "nB" : 4608,
      "top" : "dense_6__activation___output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 128,
      "blob_weights" : 19,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "flatten_2_output",
      "blob_biases" : 17,
      "has_tanh" : 0,
      "name" : "dense_6",
      "has_prelu" : 0
    },
    {
      "nB" : 128,
      "top" : "dense_7__activation___output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 23,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "dense_6__activation___output",
      "blob_biases" : 21,
      "has_tanh" : 0,
      "name" : "dense_7",
      "has_prelu" : 0
    },
    {
      "nB" : 512,
      "top" : "dense_8__activation___output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 27,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "dense_7__activation___output",
      "blob_biases" : 25,
      "has_tanh" : 0,
      "name" : "dense_8",
      "has_prelu" : 0
    },
    {
      "nB" : 512,
      "top" : "dense_9__activation___output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 128,
      "blob_weights" : 31,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "dense_8__activation___output",
      "blob_biases" : 29,
      "has_tanh" : 0,
      "name" : "dense_9",
      "has_prelu" : 0
    },
    {
      "nB" : 128,
      "top" : "dense_10_output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 26,
      "blob_weights" : 35,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "dense_9__activation___output",
      "blob_biases" : 33,
      "has_tanh" : 0,
      "name" : "dense_10",
      "has_prelu" : 0
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "output1",
      "type" : "softmax",
      "name" : "dense_10__activation__",
      "bottom" : "dense_10_output"
    }
  ]
}